/* 1、第一递归函数功能
2、找出递归结束的条件
第三要素：找出函数的等价关系式

案例1：斐波那契数列
斐波那契数列的是这样一个数列：1、1、2、3、5、8、13、21、34....，即第一项 f(1) = 1,第二项 f(2) = 1.....,第 n 项目为 f(n) = f(n-1) + f(n-2)。求第 n 项的值是多少。 */
function qibo(n) {
  if (n <= 2) {
    return 1
  }
  return qino(n - 1) + qibo(n - 2)
}

/* 案例2：小青蛙跳台阶
一只青蛙一次可以跳上1级台阶，也可以跳上2级。求该青蛙跳上一个n级的台阶总共有多少种跳法。 */
// n=1 1  n=2 2  n=3 3 n=4 5 n=5 
// f(1)=1
// f(2)=2
// f(3)=f(1)+f(2)
// f(4)=f(3)+f(2)

function f(n){
  if(n===1){
    return 1
  }
  if(n===2){
    return 2
  }
  return f(n-1)+f(n-2)
}
console.log(f(5))























// function frog(n) {
//   if (n == 1) {
//     return 1
//   }
// }

// 1, 2, 3, 4
// 4, 3, 2, 1
// fn(n){
//   if (n) {
//     return 1
//   }
//   fn()

// }